app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
  def index
    @images = Image.all

INSERT INTO "images" ("title", "keywords", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "cat"], ["keywords", "cat, tired"], ["created_at", "2021-01-17 18:32:54.608990"], ["updated_at", "2021-01-17 18:32:54.608990"]]
INSERT INTO "images" ("title", "keywords", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "cat"], ["keywords", "cat, tired"], ["created_at", "2021-01-17 17:08:46.810734"], ["updated_at", "2021-01-17 17:08:46.810734"]]
UPDATE "images" SET "updated_at" = ? WHERE "images"."id" = ?  [["updated_at", "2021-01-17 19:23:56.835409"], ["id", 5]]
---
  def create
    image = Image.create!(image_params)
    image.image.attach(params[:image][:image])
    image.save