app/views/images/index.html.erb

<ul>
  <% Image.all.each do |i| %>
---
SELECT "images".* FROM "images"